# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors: 3 # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    #[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
    [-1, 1, ConvDown, [96, 4, 4]], # 0-P2/4
    [-1, 3, C3ConvNeXt, [96]],
    [-1, 1, ConvDown, [192, 2, 2]], # 2-P3/8
    [-1, 3, C3ConvNeXt, [192]],
    [-1, 1, ConvDown, [384, 2, 2]], # 4-P4/16
    [-1, 9, C3ConvNeXt, [384]],
    [-1, 1, ConvDown, [768, 2, 2]], # 6-P5/32
    [-1, 3, C3ConvNeXt, [768]],
    [-1, 1, SPPF, [768, 5]], # 8
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [384, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [384, False]], # 12

    [-1, 1, Conv, [192, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 3], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [192, False]], # 16 (P3/8-small)

    [-1, 1, Conv, [192, 3, 2]],
    [[-1, 13], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [384, False]], # 19 (P4/16-medium)

    [-1, 1, Conv, [384, 3, 2]],
    [[-1, 9], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [768, False]], # 22 (P5/32-large)

    [[16, 19, 22], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
